<?php
/**
 * Created by PhpStorm.
 * User: dengzhihao
 * Date: 2018/1/27
 * Time: 下午8:17
 */

return [
    '200' => '操作成功',
    '403' => '权限不足',
    '404' => '数据不存在',
    '405' => 'Method Not Allowed',
    '500' => '系统错误',

    '40101' => '验证码错误',
    '40102' => '账号必须在4-20字之间',
    '40103' => '密码不能为空',
    '40104' => "两次密码输入不一致",
    '40105' => '确认密码不能为空',
    '40106' => '密码必须在6-18个字符之间',

    '40201' => '项目名称必须在2-50字之间',
    '40202' => '项目描述不能超过1000字',
    '40203' => '项目密码必须在6-20字之间',
    '40204' => '项目公开状态错误',
    '40205' => '创建失败',
    '40206' => '项目不存在',

    '40301' => '文档不存在',
    '40302' => '文档密码不正确',
    '40303' => '文档名称不能为空',
    '40304' => '同名文档已存在',
    '40305' => '权限不足',

    '40401' => '账号或密码错误',

    '40501' => '用户昵称最少3个字符，最多20字符',
    '40502' => '用户邮箱不能为空',
    '40503' => '用户邮箱不合法',
    '40504' => '手机号码不合法',
    '40505' => '描述最多500字',
    '40506' => '用户不存在',
    '40507' => '账号不能为空',
    '40508' => '账号必须以英文字母开头并且大于4个字符小于20个字符',
    '40509' => '邮箱已存在',
    '40510' => '超级管理员不能禁用',
    '40511' => '账户已被禁用',
    '40512' => '初始管理员账户不能更改角色',
    '40513' => '账号已存在',

    '40601' => '原始密码不能为空',
    '40602' => '新密码不能为空',
    '40603' => '确认密码不能为空',
    '40604' => '确认密码不正确',
    '40605' => '原始密码错误',
    '40606' => '密码错误',
    '40607' => '邮件已超过发送次数',
    '40608' => '邮件发送失败',
    '40609' => '邮件服务未启用',

    '40701' => '配置名称不能为空且必须大于3个字符小于20字符',
    '40702' => '配置键名必须以英文字母开头并且大于6个字符小于20个字符',
    '40703' => '配置项不存在',
    '40704' => '同名配置已存在',
    '40705' => '系统内置变量无法删除',



    '40801' => '该用户已参与该项目',
    '40802' => '项目转让失败',

    '40901' => '历史文档不存在',

    '50501' => '不允许的文件类型',
    '50502' => '参数错误',

    '20001' => '登录成功',
    '20002' => '创建成功',

    '60001' => '没有接口编辑或添加权限',
    '60002' => '分类名称不能为空',
    '60003' => '分类名称必须小于50个字符',
    '60004' => '请求URL不能为空且必须小于500字符',
    '60005' => '接口标题不能为空且必须小于200字符',
    '60006' => '接口分类不存在',
    '60007' => '接口请求方法错误',
    '60008' => '请求参数类型错误',



    '501' => '成功！！！',
    '502' => '失败！！！',
    '503' => '您还没有登录喔(⊙o⊙)，请赶紧登录先吧 ^_^',

    '601' => '头像上传成功，请预览进行调整！！！',
    '602' => '头像截剪成功！！！',
    '603' => '头像上传失败！！！',
    '604' => '头像上传失败！！！',
    '605' => '头像修改成功！！！',
    '606' => '图片上传失败！！！',

    '701' => '问题删除成功！！！',
    '702' => '问题删除失败！！！',
    '703' => '该回答将作为此问题最佳答案！！！',
    '704' => '问题舍弃成功！！！',
    '705' => '问题舍弃失败！！！',
    '706' => '博客删除成功！！！',
    '707' => '博客删除失败！！！',
    '708' => '博客舍弃成功！！！',
    '709' => '博客舍弃失败！！！',
    '710' => '博客评论删除成功！！！',
    '711' => '博客评论删除失败！！！',

    '801' => '感谢您的宝贵意见O(∩_∩)O',

    '890' => '邮箱地址验证正确',
    '891' => '邮箱地址验证失败',
    '892' => '邮箱地址不存在',
    '893' => '手机号码验证正确',
    '894' => '手机号码验证失败',
    '895' => '手机号码不存在。',
    '896' => '新手机号码 已被使用。',
    '897' => '手机号码绑定失败',
    '898' => '恭喜您，手机号码绑定成功 ^_^',
    '899' => '您一分钟内已发送过验证码，请一分钟后再重新获取 ^_^',
    '900' => '短信验证码发送成功，请查收 ^_^',
    '901' => '短信验证码发送失败',
    '902' => '手机号已存在，提交信息即绑定社交帐号。',
    '903' => '手机号可用，请输入密码。',

    '904' => '提交信息即创建新账号。',
    '905' => '验证码正确。',
    '906' => '用户名已存在，请重新输入。',
    '907' => '用户名可用。',

    '908' => '新邮箱地址 已被使用。',
    '909' => '邮箱地址绑定第一步完成，请前往邮箱验证 ^_^',
    '910' => '邮箱地址绑定失败 ^_^',

    '911' => '用户注册失败',
    '912' => '用户不存在',
    '913' => '重置密码成功 ^_^',

    '914' => '图片格式不符合，请重新上传 ^_^',
    '915' => '真实姓名 不能为空，请输入 ^_^',
    '916' => '身份证号码 不能为空，请输入 ^_^',
    '917' => '图片信息有误，请重新上传 ^_^',
];